import ProgramData from "./ProgramData.js";

export default {
  defaultFileName: ProgramData.GAME_NAME + "-Save-File",
  mimeType: "image/png",
  encoding: "UTF-8",
  Ȩ̵̧̨̡̨̨̡̨̨̛̥͇͈̜̞̣̥̘͖̗̹̰̜̱̖̪͖̟͖̬̤͙̝̼̠͔̼̖̻̹̘̭̮̤͔͙͍̟̟͍̼͙͙̖͍̳̪͇̦͈͈̙͚̳̹͙̻̟͍̖̹̼̻̱̙̱͔͙͉̤̤̳͉̺͖̻͙͔̹̭̠̥͓̜̣̱̭̫̜̮̻̙͉̻̬͇̫̦͎̖̙̼̫̣̳͍̘̀͛͛́̅́͂̔̀̽̿͊̈́̓͛̎̎̄̏͌͆̏̅̀͗̀͂̚͜͜͝ͅͅͅͅE̸̢̛͚̞͙̙̱̙͓̲̺͎̻̲͎̟͔͇̦̮͉̣̻͇͂͗̔͐̈́̅̍̀͒̀͋̄̉͌̌̅̓̔̉̋̋̏̾̒́̉̎̄̄̕͘͝͠͝ͅẸ̶̢̡̢̧̨̱̙̟̳̝̣̹̣̪̮̣̱̯͙͕̭̼̦̟̝͇̞̮̦͙̻̤̣̻͕̞͉̣̪̪̬͓̠̰̪̪̦̲̲̟̱͉͉̩͓͍͕̲͔̭͚̟̼̙̬̬̳͚̮̭̤͓̟͖̮̗͈͍̜̝̗͎̤͓̱̟̭͖͉͔̩̹͇̪͇̎͆̐̄̄͜ͅͅḜ̵̛̼̤͓͔̙̰̫̩̖̫̗̳̱̩̈́̌̎̓͐̂͐̾̀̔̈͛́̈́̓̃̈́̾̀͑̇̓͌̌̈́̃̈́͊̈́̎͒͂͊̀̿̒̆̉̐̈́̔̕͘̕̚͝͠͝͝Ě̸̡̢̨̛̛̛̜̲̤̟̠̜̻̞̘̲̥̠̞̭̖̬͉͉̻̪̬̞͖͎͈̯̪̝̻̖̙̹̭̰̪̥̣̰̞̪̙̝̦̟̭̲̥͙̤̘̼̺͍͈̲͕͇̗̻͈͖͇͚̀̔̌̔̈́̋̿̃̀̐̆̍͊͐͋̂̓́̃̇͒̿̽̏̾̀͂͛͌̃̀̋͋͗̀̉̊̒͆̀̔̈́̓̊͒̀̄͌̑́͆̓̃̇́̀͊̓͌̂̑̃̏̊̓͛̄̓̓̒̂̄̾̿̀̑͑͛̉͆͛̋̉̍̌̌͗́̀̔͗̓̃̋̏̈́̈̈́͊̈́̿͗̇́͊̂̏̍͋̊̆̈́̀̀̀̈́͆̇͂͐̐̒̒͘̕͘̚͘͘̕̕̕̚͜͝͝͠͠͝͠͝ͅȨ̵̢̢̢̨̛̭̤̟̗̠̣̲̗͎̱̳̯̺̪͈̙͙̝̱̹͈̩̫̲͔̳͎͍̺̭͉̞̫̼͉̙̬̝͉͓̲̲̫͉͈͈͉̠̳̠̩̏̀̃̾̅̀͋̅͆̑̈́̈́̔͗͑̎̈͒̽̆͂̏̅͛̄͐́̈́̅͘͝͠͝͝ͅĘ̶̧̡͕͎̘̪͍̟̯͖̣̘̞̘̪̜̰̬̤̤͎͎͖̫̟̤̪͍̠̖̪̼̲͓͙͇̲̞͇̰̤͙͉͍̱̘̝͍̥̬̹͊̃͜͜͜E̸̡̧̡̨̧̧̧̧̢̧̛̛̛̛̲͍̝̼͔̝͇͕̳̳͉̯͕̙̻̹͓̬͔̫͇̻͈̗̳͔̻͍̩̮̼̯͎̙̯̙͙̝͙̰͇̯̗̺̝̥͈͉̖̖͉͔̞̘̤̱̪̪̝̰̣̯̟̟̝͎͓̝̞̳̱̤̮̲͕̜̰͌͑̏̐̉̑̈́̓̋͑͑̓̇͑̈̋̆͌͌̎̄̈́͗́̋̎̀̋̀͌͂̓͋̀̒̋̑̈́̇̂͗̍̈́̿̾̌̈̓̃̌̊͑͋̊̂̽̃̍̄̌͗̆̓̅́͐͂̃͂͗̐̎̿̄̿̍̽̐̌̅̈́̌̓̒͛̍̆̓̈́̂̓͛̏͗̏́̇̈́͊̊̾̅̓̃̓̒̂͌͆͐͐̌̈̿̅͐̎̏͘̚̕̚͘̕͘̕͘̕͜͝͝͝͠͠͠͠͝͠͠͝͝͠͝͠͝͝ͅͅͅͅĘ̸̡̢̡̨̢̡̡̡̨̢̧̨̺͈̞͈̺͇̹̙̙̗̹̞̺̼̼͕̱̺̹̩͉̩̩̗̞̭̜͔͇̠̫̤̭̻̝͕̳̭̠̹̬̱̝̭̝̭̹̝̗̦̟̭̳͕̤͚̻̮͔̗̜͚̯̼͚̯̪̣̠͓̺͖̻̤͖̣̫̥̗͉͚͍͈̳̯͎̦͚̹͖̰͉̺͕͚͈̬̟͎̪͚͖͍̜͇͖͖͕̼͕̯͙͎̹̈́̈̽̊̏̾̉́́̂̒͒̏̅̽͑̓̔̈̔̉̈͑̂̒̅̕̚̕͘͜͜͜͜ͅͅͅͅͅͅ : "5fa90686f2eb6fc3308ce71e560414c8",
};